Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.IsValidPanelConfiguration(Autodesk.Revit.DB.Electrical.PanelScheduleType,Autodesk.Revit.DB.Electrical.PanelConfiguration)
Checks if given panel configuration is valid for given panel schedule type.
Remarks:
If the panel schedule type is branch panel, the valid panel configurations are:
PanelConfiguration::Enum::OneColumn
PanelConfiguration::Enum::TwoColumnsCircuitsAcross
PanelConfiguration::Enum::TwoColumnsCircuitsDown
If the panel schedule type is switchboard or data panel, the valid panel configuration is:
PanelConfiguration::Enum::OneColumn
scheduleType:
The panel schedule type.
configuration:
The given configuration to check.
Returns:
True if panel schedule template can have a valid configuration assigned, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.HasSameType(Autodesk.Revit.DB.Electrical.PanelScheduleTemplate)
Checks if given template has the same panel schedule type with this template.
Remarks:
The panel schedule type is the enum type of PanelScheduleType class (Branch, switchboard, data etc.)
otherTemplate:
The given template to check.
Returns:
True if the given template has the same panel schedule type with this template, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.IsValidType(Autodesk.Revit.DB.Electrical.PanelScheduleType)
Checks if given type is valid for this panel schedule template element.
Remarks:
A type is valid for a panel schedule template element if it is defined by the PanelScheduleType class.
Note: PanelScheduleType::Enum::Unknown is not a valid type, it is used for initializing the variable of
the PanelScheduleType::Enum.
panelScheduleType:
The given type to check.
Returns:
True if panel schedule template can have a type assigned and this type is valid for this element, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.GetSectionData(Autodesk.Revit.DB.SectionType)
Gets the writable section data object.
Remarks:
Access to this information requires an open transaction.
Returns:
The table section data object.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.GetTableData
Gets the writable table data object.
Remarks:
Access to this information requires an open transaction.
Returns:
The panel schedule data object.

Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.SetTableData(Autodesk.Revit.DB.Electrical.PanelScheduleData)
Assigns table data to this template
Data:
The panel schedule data
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.GetPanelScheduleType
Returns the panel schedule type.

Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.CopyFrom(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Electrical.PanelScheduleTemplate)
Copies all values from other element to this object.
OtherADoc:
The Document for the otherElem
otherElem:
The element being copied from.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given template otherElem has different type of this element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Electrical.PanelScheduleType,Autodesk.Revit.DB.Electrical.PanelConfiguration,System.String)
Creates a new instance of a panel schedule template.
Remarks:
If the given name has already been used by existing panel schedule templates,
a unique name will be used for the newly created template.
document:
The document where the element will be created and added.
type:
The panel schedule type.
config:
The panel configuration type.
strName:
The name of the panel schedule template to be created.
Returns:
The newly created panel schedule template element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The type is not valid for this element.
-or-
The config is not valid for panel schedule type type of this template.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.IsDefault
Checks to see if this is default template for the given panel schedule type.

Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.IsSwitchboardSchedule
Checks to see if this object is switchboard schedule template element.

Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.IsDataPanelSchedule
Checks to see if this object is data panel schedule template element.

Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.IsBranchPanelSchedule
Checks to see if this object is branch panel schedule template element.

Autodesk.Revit.DB.Electrical.PanelScheduleTemplate
The PanelScheduleTemplate class represents an instance of panel schedule template
element. An instance object could be a branch panel, a switchboard or a data panel template.